/*
 * display.c
 *
 * created: 2021/5/21
 *  author:
 */
#include "hc595.h"
#include "tick.h"
#include "ls1b_gpio.h"

//共阳极数码管
//unsigned char distab[10] = {0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90};
//共阴极数码管
//unsigned char distab[10] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};

/*************************************************************************************
 **函数功能：HC595初始化IO口
 **说明：
 **************************************************************************************/
void HC595_init(void)
{
    gpio_enable(DIO,DIR_OUT);
    gpio_enable(SCLK,DIR_OUT);
    gpio_enable(RCLK,DIR_OUT);
}

/*************************************************************************************
 **函数功能：位选
 **说明：
 **************************************************************************************/
void HC595_Send_Data(unsigned char dat)
{
    unsigned char i;
    for(i = 0; i < 8; i++)
    {
        if( ( dat << i ) & 0x80)
        {
            DATA_H;
        }
        else
        {
            DATA_L;
        }
        SCLK_L;
        delay_us(2);
        SCLK_H;
    }
}

/*************************************************************************************
 **函数功能：数据全部输出
 **说明：
 **************************************************************************************/
void HC595_Out(void)
{
    RCLK_L;
    delay_us(2);
    RCLK_H;
}



